Reports/б_СметаРасходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Report>
		<Properties>
			<Name>б_СметаРасходов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаПериода</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеСпискаОрганизаций</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеСпискаПодразделений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасширеннаяНастройка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтрицательноеКрасным</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеОтчета</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормируемыйБюджет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.фин_Бюджеты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядкиОкругленияОтчетности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяБюджета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.фин_СтатьиБюджета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

AccumulationRegisters/б_Бюджет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>б_Бюджет</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяБюджета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.фин_СтатьиБюджета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Бюджет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.фин_Бюджеты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДополнительнаяАналитика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
						<v8:Type>cfg:CatalogRef.фин_СтатьиБюджета</v8:Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
						<v8:Type>cfg:CatalogRef.НематериальныеАктивы</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИсточникФинансирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.битИсточникиФинансирования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ПорядкиОкругленияОтчетности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ПорядкиОкругленияОтчетности</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Окр1</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Окр1000</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Окр1000000</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Reports/б_СметаРасходов/Ext/ObjectModule.bsl
Перем мСписокИсточниковФинансирования Экспорт;
Перем мСписокСтруктурныхЕдиниц Экспорт;
Перем мСписокПодразделений Экспорт;
Перем мДеревоСтруктурныхЕдиниц Экспорт;
Перем СохраненнаяНастройка Экспорт;
Перем Расшифровки Экспорт;
Перем ПромежуточныеДанные Экспорт;
Перем РежимРасшифровки Экспорт;
Перем ВедётсяУчетПоПодразделениям Экспорт;

#Если Клиент Тогда

Процедура ЗаполнитьНачальныеНастройки() Экспорт
	
	СтандартныеОтчеты.ЗаполнитьДанныеОтчета(ЭтотОбъект);
	
КонецПроцедуры

Процедура СформироватьОтчет(Результат = Неопределено, ДанныеРасшифровки = Неопределено, ВыводВФормуОтчета = Истина, ВнешниеНаборыДанных = Неопределено) Экспорт
	
	Результат.Очистить();
	
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	ВыводЗаголовкаОтчета(ЭтотОбъект, Результат);
	ДоработатьКомпоновщикПередВыводом(ВнешниеНаборыДанных);
	СтандартныеОтчеты.ВывестиОтчет(ЭтотОбъект, Результат, ДанныеРасшифровки, ВыводВФормуОтчета, ВнешниеНаборыДанных);
	КомпоновщикНастроек.ЗагрузитьНастройки(Настройки);
	
	// Выполним дополнительную обработку Результата отчета
	ОбработкаРезультатаОтчета(Результат);
	
	
	УправлениеОтчетами.УстановитьКолонтитулыПоУмолчанию(Результат, ПолучитьТекстЗаголовка(), Строка(глТекущийПользователь));
	
	Возврат;
	
КонецПроцедуры

// В процедуре можно доработать компоновщик перед выводом в отчет
// Изменения сохранены не будут
Процедура ДоработатьКомпоновщикПередВыводом(ВнешниеНаборыДанных) Экспорт
	
	Если ЗначениеЗаполнено(НачалоПериода) Тогда
		ТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "НачалоПериода", НачалоДня(НачалоПериода));
	Иначе
		ТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "НачалоПериода", Дата(1, 1, 1));
	КонецЕсли;
	Если ЗначениеЗаполнено(КонецПериода) Тогда
		ТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "КонецПериода", КонецДня(КонецПериода));
	Иначе
		ТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "КонецПериода", Дата(3999, 11, 1));
	КонецЕсли;
	
	ВнешниеНаборыДанных = Новый Структура;
	ВыборкаДанных = ПолучитьВыборку();
	ВнешниеНаборыДанных.Вставить("ТаблицаДанных", ВыборкаДанных);
	
	Поле = СхемаКомпоновкиДанных.НаборыДанных[0].Поля.Найти("СуммаИтого");
	Если Поле <> Неопределено Тогда
		Поле.Заголовок = "План "+Год(НачалоПериода)+" год";
	КонецЕсли;
	
	
	Если мДеревоСтруктурныхЕдиниц.Колонки.Количество() = 0 Тогда 
		
		СписокСтруктурныхЕдиниц = Новый СписокЗначений;
		СписокСтруктурныхЕдиниц.ЗагрузитьЗначения(мСписокСтруктурныхЕдиниц.ВыгрузитьЗначения());
		
		Для Каждого СтрПодразделение Из мСписокПодразделений Цикл 
			СписокСтруктурныхЕдиниц.Добавить(СтрПодразделение.Значение);
		КонецЦикла;		
				
		мДеревоСтруктурныхЕдиниц = СтандартныеОтчеты.СформироватьДеревоСЕ(, СписокСтруктурныхЕдиниц);
		
	КонецЕсли;
	
	//ТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "ФормируемыйБюджет", ФормируемыйБюджет);
	//ТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "СтатьяБюджета", СтатьяБюджета);
	ТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "ЕдиницаИзмерения", ЕдиницаИзмерения);
	
	ТиповыеОтчеты.ДобавитьОтборПоОрганизациямИПодразделениям(КомпоновщикНастроек, мДеревоСтруктурныхЕдиниц);
	
КонецПроцедуры

Процедура ИнициализацияОтчета() Экспорт
	
	СтандартныеОтчеты.ИнициализацияОтчета(ЭтотОбъект);
	
КонецПроцедуры

Процедура ВыводПодписиОтчета(Результат)
	
	//Макет = ПолучитьОбщийМакет("ОбщиеОбластиСтандартногоОтчета");
	//ОбластьПодписи        = Макет.ПолучитьОбласть("ПодписиПроверил");
	//Результат.Вывести(ОбластьПодписи);
	
КонецПроцедуры

Процедура ВыводЗаголовкаОтчета(ОтчетОбъект, Результат)
	
	СтандартныеОтчеты.ВыводЗаголовкаСпециализированногоОтчета(ОтчетОбъект, Результат);
			
КонецПроцедуры

Функция ПолучитьТекстЗаголовка(ОрганизацияВНачале = Истина) Экспорт 
		
	ЗаголовокОтчета = "Смета расходов" + СтандартныеОтчеты.ПолучитьПредставлениеПериода(ЭтотОбъект);

	Возврат ?(ОрганизацияВНачале, ЗаголовокОтчета, ЗаголовокОтчета + " " + СтандартныеОтчеты.ПолучитьТекстОрганизация(ЭтотОбъект));
		
КонецФункции

Функция ПолучитьВыборку ()
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	БюджетОбороты.Организация КАК Организация,
	|	БюджетОбороты.СтатьяБюджета КАК СтатьяБюджета,
	|	БюджетОбороты.Статус,
	|	БюджетОбороты.Регистратор КАК ДокументДвижения,
	|	ВЫБОР
	|			КОГДА МЕСЯЦ(БюджетОбороты.Период) = 1
	|				ТОГДА ВЫБОР
	|						КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|							ТОГДА ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0) / 1000000
	|						ИНАЧЕ ВЫБОР
	|								КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|									ТОГДА ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0) / 1000
	|								ИНАЧЕ ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0)
	|							КОНЕЦ
	|					КОНЕЦ
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК СуммаЯнварь,
	|		ВЫБОР
	|			КОГДА МЕСЯЦ(БюджетОбороты.Период) = 2
	|				ТОГДА ВЫБОР
	|						КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|							ТОГДА ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0) / 1000000
	|						ИНАЧЕ ВЫБОР
	|								КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|									ТОГДА ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0) / 1000
	|								ИНАЧЕ ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0)
	|							КОНЕЦ
	|					КОНЕЦ
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК СуммаФевраль,
	|		ВЫБОР
	|			КОГДА МЕСЯЦ(БюджетОбороты.Период) = 3
	|				ТОГДА ВЫБОР
	|						КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|						ТОГДА ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0) / 1000000
	|						ИНАЧЕ ВЫБОР
	|								КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|									ТОГДА ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0) / 1000
	|								ИНАЧЕ ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0)
	|							КОНЕЦ
	|					КОНЕЦ
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК СуммаМарт,
	|		ВЫБОР
	|			КОГДА МЕСЯЦ(БюджетОбороты.Период) = 4
	|				ТОГДА ВЫБОР
	|						КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|							ТОГДА ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0) / 1000000
	|						ИНАЧЕ ВЫБОР
	|								КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|									ТОГДА ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0) / 1000
	|								ИНАЧЕ ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0)
	|							КОНЕЦ
	|					КОНЕЦ
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК СуммаАпрель,
	|		ВЫБОР
	|			КОГДА МЕСЯЦ(БюджетОбороты.Период) = 5
	|				ТОГДА ВЫБОР
	|						КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|							ТОГДА ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0) / 1000000
	|						ИНАЧЕ ВЫБОР
	|								КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|									ТОГДА ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0) / 1000
	|								ИНАЧЕ ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0)
	|							КОНЕЦ
	|					КОНЕЦ
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК СуммаМай,
	|		ВЫБОР
	|			КОГДА МЕСЯЦ(БюджетОбороты.Период) = 6
	|				ТОГДА ВЫБОР
	|						КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|							ТОГДА ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0) / 1000000
	|						ИНАЧЕ ВЫБОР
	|								КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|									ТОГДА ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0) / 1000
	|								ИНАЧЕ ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0)
	|							КОНЕЦ
	|					КОНЕЦ
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК СуммаИюнь,
	|		ВЫБОР
	|			КОГДА МЕСЯЦ(БюджетОбороты.Период) = 7
	|				ТОГДА ВЫБОР
	|						КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|							ТОГДА ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0) / 1000000
	|						ИНАЧЕ ВЫБОР
	|								КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|									ТОГДА ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0) / 1000
	|								ИНАЧЕ ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0)
	|							КОНЕЦ
	|					КОНЕЦ
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК СуммаИюль,
	|		ВЫБОР
	|			КОГДА МЕСЯЦ(БюджетОбороты.Период) = 8
	|				ТОГДА ВЫБОР
	|						КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|							ТОГДА ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0) / 1000000
	|						ИНАЧЕ ВЫБОР
	|								КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|									ТОГДА ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0) / 1000
	|								ИНАЧЕ ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0)
	|							КОНЕЦ
	|					КОНЕЦ
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК СуммаАвгуст,
	|		ВЫБОР
	|			КОГДА МЕСЯЦ(БюджетОбороты.Период) = 9
	|				ТОГДА ВЫБОР
	|						КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|							ТОГДА ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0) / 1000000
	|						ИНАЧЕ ВЫБОР
	|								КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|									ТОГДА ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0) / 1000
	|								ИНАЧЕ ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0)
	|							КОНЕЦ
	|					КОНЕЦ
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК СуммаСентябрь,
	|		ВЫБОР
	|			КОГДА МЕСЯЦ(БюджетОбороты.Период) = 10
	|				ТОГДА ВЫБОР
	|						КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|							ТОГДА ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0) / 1000000
	|						ИНАЧЕ ВЫБОР
	|								КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|									ТОГДА ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0) / 1000
	|								ИНАЧЕ ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0)
	|							КОНЕЦ
	|					КОНЕЦ
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК СуммаОктябрь,
	|		ВЫБОР
	|			КОГДА МЕСЯЦ(БюджетОбороты.Период) = 11
	|				ТОГДА ВЫБОР
	|						КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|							ТОГДА ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0) / 1000000
	|						ИНАЧЕ ВЫБОР
	|								КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|									ТОГДА ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0) / 1000
	|								ИНАЧЕ ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0)
	|							КОНЕЦ
	|					КОНЕЦ
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК СуммаНоябрь,
	|		ВЫБОР
	|			КОГДА МЕСЯЦ(БюджетОбороты.Период) = 12
	|				ТОГДА ВЫБОР
	|						КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|							ТОГДА ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0) / 1000000
	|						ИНАЧЕ ВЫБОР
	|								КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|									ТОГДА ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0) / 1000
	|								ИНАЧЕ ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0)
	|							КОНЕЦ
	|					КОНЕЦ
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК СуммаДекабрь,
	|		ВЫБОР
	|			КОГДА МЕСЯЦ(БюджетОбороты.Период) < 4
	|				ТОГДА ВЫБОР
	|						КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|							ТОГДА ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0) / 1000000
	|						ИНАЧЕ ВЫБОР
	|								КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|									ТОГДА ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0) / 1000
	|								ИНАЧЕ ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0)
	|							КОНЕЦ
	|					КОНЕЦ
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК СуммаПервыйКвартал,
	|		ВЫБОР
	|			КОГДА МЕСЯЦ(БюджетОбороты.Период) > 3
	|					И МЕСЯЦ(БюджетОбороты.Период) < 7
	|				ТОГДА ВЫБОР
	|						КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|							ТОГДА ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0) / 1000000
	|						ИНАЧЕ ВЫБОР
	|								КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|									ТОГДА ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0) / 1000
	|								ИНАЧЕ ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0)
	|							КОНЕЦ
	|					КОНЕЦ
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК СуммаВторойКвартал,
	|		ВЫБОР
	|			КОГДА МЕСЯЦ(БюджетОбороты.Период) > 6
	|					И МЕСЯЦ(БюджетОбороты.Период) < 10
	|				ТОГДА ВЫБОР
	|						КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|							ТОГДА ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0) / 1000000
	|						ИНАЧЕ ВЫБОР
	|								КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|									ТОГДА ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0) / 1000
	|								ИНАЧЕ ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0)
	|							КОНЕЦ
	|					КОНЕЦ
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК СуммаТретийКвартал,
	|		ВЫБОР
	|			КОГДА МЕСЯЦ(БюджетОбороты.Период) > 9
	|				ТОГДА ВЫБОР
	|						КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|							ТОГДА ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0) / 1000000
	|						ИНАЧЕ ВЫБОР
	|								КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|									ТОГДА ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0) / 1000
	|								ИНАЧЕ ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0)
	|							КОНЕЦ
	|					КОНЕЦ
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК СуммаЧетвертыйКвартал,
	|		ВЫБОР
	|			КОГДА МЕСЯЦ(БюджетОбороты.Период) < 7
	|				ТОГДА ВЫБОР
	|						КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|							ТОГДА ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0) / 1000000
	|						ИНАЧЕ ВЫБОР
	|								КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|									ТОГДА ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0) / 1000
	|								ИНАЧЕ ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0)
	|							КОНЕЦ
	|					КОНЕЦ
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК СуммаЗаПолугодие,
	|		ВЫБОР
	|			КОГДА МЕСЯЦ(БюджетОбороты.Период) < 10
	|				ТОГДА ВЫБОР
	|						КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|							ТОГДА ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0) / 1000000
	|						ИНАЧЕ ВЫБОР
	|								КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|									ТОГДА ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0) / 1000
	|								ИНАЧЕ ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0)
	|							КОНЕЦ
	|					КОНЕЦ
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК СуммаЗаДевятьМесяцев,
	|		ВЫБОР
	|			КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|				ТОГДА ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0) / 1000000
	|			ИНАЧЕ ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|						ТОГДА ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0) / 1000
	|					ИНАЧЕ ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0)
	|				КОНЕЦ
	|		КОНЕЦ КАК СуммаИтого,
	|		0 КАК ПризнакКоличество
	|	ИЗ
	|		РегистрНакопления.б_Бюджет.Обороты(&Началопериода, &КонецПериода, Регистратор, Бюджет = &ФормируемыйБюджет и СтатьяБюджета в ИЕРАРХИИ(&СтатьяБюджета)) КАК БюджетОбороты
	|
	|";

	Запрос.УстановитьПараметр("ЕдиницаИзмерения",ЕдиницаИзмерения);
	Запрос.УстановитьПараметр("ФормируемыйБюджет",ФормируемыйБюджет);
	Запрос.УстановитьПараметр("СтатьяБюджета",СтатьяБюджета);
	Запрос.УстановитьПараметр("НачалоПериода",НачалоДня(НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода",КонецДня(КонецПериода));
	
	Возврат Запрос.Выполнить();

КонецФункции

Процедура ОбработкаРезультатаОтчета(Результат)
	
	ТиповыеОтчеты.ОбработкаРезультатаОтчета(ЭтотОбъект, Результат);

КонецПроцедуры

// Для настройки отчета (расшифровка и др.)
Процедура Настроить(Отбор, КомпоновщикНастроекОсновногоОтчета = Неопределено) Экспорт
	
	//ТиповыеОтчеты.НастроитьТиповойОтчет(ЭтотОбъект, Отбор, КомпоновщикНастроекОсновногоОтчета);
	ЗаполнитьНачальныеНастройки();
	
КонецПроцедуры

Процедура СохранитьНастройку() Экспорт
	
	СтруктураНастроек = ТиповыеОтчеты.ПолучитьСтруктуруПараметровТиповогоОтчета(ЭтотОбъект);
	
	СтруктураНастроек.Вставить("мСписокПодразделений", мСписокПодразделений);
	СтруктураНастроек.Вставить("мСписокСтруктурныхЕдиниц", мСписокСтруктурныхЕдиниц);
	СтруктураНастроек.Вставить("мДеревоСтруктурныхЕдиниц", мДеревоСтруктурныхЕдиниц);
	
	СохранениеНастроек.СохранитьНастройкуОбъекта(СохраненнаяНастройка, СтруктураНастроек);

КонецПроцедуры

// Процедура заполняет параметры отчета по элементу справочника из переменной СохраненнаяНастройка.
Процедура ПрименитьНастройку() Экспорт
	
	Если СохраненнаяНастройка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	 
	СтруктураПараметров = СохраненнаяНастройка.ХранилищеНастроек.Получить();
	ТиповыеОтчеты.ПрименитьСтруктуруПараметровОтчета(ЭтотОбъект, СтруктураПараметров);
	
КонецПроцедуры


Расшифровки = Новый СписокЗначений;

НастройкаПериода = Новый НастройкаПериода;

#КонецЕсли
мСписокИсточниковФинансирования = Новый СписокЗначений;
мСписокСтруктурныхЕдиниц = Новый СписокЗначений;
мСписокПодразделений = Новый СписокЗначений;
мДеревоСтруктурныхЕдиниц = Новый ДеревоЗначений;

ВедётсяУчетПоПодразделениям = ОбщегоНазначения.ПолучитьПризнакОтображенияСтруктурныхПодразделений();

РежимРасшифровки = Ложь;
